Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File            : main.c
  * Brief           : PlusCart(+) Firmware
  * Author          : Wolfgang Stubig <w.stubig@firmaplus.de>
  * Website         : https://gitlab.com/firmaplus/atari-2600-pluscart
  ******************************************************************************
  * (c) 2019 Wolfgang Stubig (Al_Nafuur)
  * based on: UnoCart2600 by Robin Edwards (ElectroTrains)
  *           https://github.com/robinhedwards/UnoCart-2600
  ******************************************************************************
  * This program is free software: you can redistribute it and/or modify
  * it under the terms of the GNU General Public License as published by
  * the Free Software Foundation, either version 3 of the License, or
  * (at your option) any later version.
  *
  * This program is distributed in the hope that it will be useful,
  * but WITHOUT ANY WARRANTY; without even the implied warranty of
  * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  * GNU General Public License for more details.
  *
  * You should have received a copy of the GNU General Public License
  * along with this program.  If not, see <http://www.gnu.org/licenses/>.
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <ctype.h>
#include <string.h>

#include "global.h"
#include "esp8266.h"
#include "cartridge_io.h"
#include "cartridge_firmware.h"
#include "cartridge_supercharger.h"
#include "cartridge_detection.h"
#include "cartridge_emulation.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

EXT_TO_CART_TYPE_MAP ext_to_cart_type_map[]__attribute__((section(".ccmram"))) = {
	{"ROM", { base_type_None, FALSE, FALSE }},
	{"BIN", { base_type_None, FALSE, FALSE }},
	{"A26", { base_type_None, FALSE, FALSE }},
	{"2K",  { base_type_2K, FALSE, FALSE }},
	{"4K",  { base_type_4K, FALSE, FALSE }},
	{"F8",  { base_type_F8, FALSE, FALSE }},
	{"F6",  { base_type_F6, FALSE, FALSE }},
	{"F4",  { base_type_F4, FALSE, FALSE }},
	{"F8S", { base_type_F8, TRUE, FALSE }},
	{"F6S", { base_type_F6, TRUE, FALSE }},
	{"F4S", { base_type_F4, TRUE, FALSE }},
	{"FE",  { base_type_FE, FALSE, FALSE }},
	{"3F",  { base_type_3F, FALSE, FALSE }},
	{"3E",  { base_type_3E, FALSE, FALSE }},
	{"E0",  { base_type_E0, FALSE, FALSE }},
	{"084", { base_type_0840, FALSE, FALSE }},
	{"CV", { base_type_CV, FALSE, FALSE }},
	{"EF", { base_type_EF, FALSE, FALSE }},
	{"EFS", { base_type_EF, TRUE, FALSE }},
	{"F0", { base_type_F0, FALSE, FALSE }},
	{"FA", { base_type_FA, FALSE, FALSE }},
	{"E7", { base_type_E7, FALSE, FALSE }},
	{"DPC", { base_type_DPC, FALSE, FALSE }},
	{"AR",  { base_type_AR, FALSE, FALSE }},
	{0,{0,0,0}}
};

#define HTTP_REQUEST_CHUNK_PARAM_POS  15

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart1;


/* USER CODE BEGIN PV */
uint8_t c;
int num_menu_entries = 0; // how many entries in the current menu
char http_request_header[512]__attribute__((section(".ccmram")));

uint8_t buffer[BUFFER_SIZE * 1024];
unsigned int cart_size_bytes;
uint8_t tv_mode;



char curPath[256]__attribute__((section(".ccmram")));

extern FLASH_ProcessTypeDef pFlash;



/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */

HAL_StatusTypeDef FLASH_WaitInRAMForLastOperationWithMaxDelay() __attribute__((section(".data#")));
void do_firmware_update(uint32_t filesize, uint8_t *http_request_header)__attribute__((section(".data#")));


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


HAL_StatusTypeDef FLASH_WaitInRAMForLastOperationWithMaxDelay()
{
  /* Wait for the FLASH operation to complete by polling on BUSY flag to be reset.
     Even if the FLASH operation fails, the BUSY flag will be reset and an error
     flag will be set */
  while(__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != RESET)
  {
  }

  /* Check FLASH End of Operation flag  */
  if (__HAL_FLASH_GET_FLAG(FLASH_FLAG_EOP) != RESET)
  {
    /* Clear FLASH End of Operation pending bit */
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP);
  }
#if defined(FLASH_SR_RDERR)
  if(__HAL_FLASH_GET_FLAG((FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | \
                           FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR | FLASH_FLAG_RDERR)) != RESET)
#else
  if(__HAL_FLASH_GET_FLAG((FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | \
                           FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR)) != RESET)
#endif /* FLASH_SR_RDERR */
  {
    /*Save the error code*/
    return HAL_ERROR;
  }

  /* If there is no error flag set */
  return HAL_OK;

}


void do_firmware_update(uint32_t filesize, uint8_t *http_request_header){

	uint32_t Address = ADDR_FLASH_SECTOR_0;
	uint32_t count=0;
	uint8_t c;
	HAL_StatusTypeDef status;


	//HAL_FLASHEx_Erase();
	// Process Locked
	// __HAL_LOCK(&pFlash);
	pFlash.Lock = HAL_LOCKED;

	// Wait for last operation to be completed
	if(FLASH_WaitInRAMForLastOperationWithMaxDelay() == HAL_OK)
	{
	      for( count = FLASH_SECTOR_0; count < FLASH_SECTOR_6; count++)
	      {
//	        FLASH_Erase_Sector(count, (uint8_t) FLASH_VOLTAGE_RANGE_3);
	    	  CLEAR_BIT(FLASH->CR, FLASH_CR_PSIZE);
	    	  FLASH->CR |= FLASH_PSIZE_WORD;
	    	  CLEAR_BIT(FLASH->CR, FLASH_CR_SNB);
	    	  FLASH->CR |= FLASH_CR_SER | (count << FLASH_CR_SNB_Pos);
	    	  FLASH->CR |= FLASH_CR_STRT;

	        /* Wait for last operation to be completed */
	        status = FLASH_WaitInRAMForLastOperationWithMaxDelay();

	        /* If the erase operation is completed, disable the SER and SNB Bits */
	        CLEAR_BIT(FLASH->CR, (FLASH_CR_SER | FLASH_CR_SNB));

	        if(status != HAL_OK)
	        {
	          /* In case of error, stop erase procedure and return the faulty sector*/
	          break;
	        }
	      }


	}else{
		return; // or try flashing anyway ??
	}

	  /* Process Unlocked */
	  __HAL_UNLOCK(&pFlash);

//end HAL_FLASHEx_Erase();

	    /* Flush the caches to be sure of the data consistency */
	  __HAL_FLASH_DATA_CACHE_DISABLE();
	  __HAL_FLASH_INSTRUCTION_CACHE_DISABLE();

	  __HAL_FLASH_DATA_CACHE_RESET();
	  __HAL_FLASH_INSTRUCTION_CACHE_RESET();

	  __HAL_FLASH_INSTRUCTION_CACHE_ENABLE();
	  __HAL_FLASH_DATA_CACHE_ENABLE();


	  //__HAL_LOCK(&pFlash);

	  pFlash.Lock = HAL_LOCKED;
		FLASH_WaitInRAMForLastOperationWithMaxDelay();

	  uint8_t chunks = ( filesize + 4095 )  / 4096;         //  use Real HTTP Range requests??
	    uint16_t lastChunkSize = filesize % 4096;
	    while(chunks != 0 ){
	    	count = 0;
			while(1){ // todo set and break on timeout ?
				if(( huart1.Instance->SR & UART_FLAG_TXE) == UART_FLAG_TXE){ // ! (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_TXE) ) ){
					huart1.Instance->DR = http_request_header[count++]; // & (uint8_t)0xFF);
					if(http_request_header[count] == '\0')
						break;
				}
			}
	    	count = 0;

	    	// Skip HTTP Header
	    	while(1){ // todo set and break on timeout ?
                if(( huart1.Instance->SR & UART_FLAG_RXNE) == UART_FLAG_RXNE){ // ! (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_TXE) ) ){
					if( (uint8_t)huart1.Instance->DR == '\n' ){
						if (count == 1)
							break;
						count = 0;
					}else{
						count++;
					}
                }
	    	}

