Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	    	// Now for the HTTP Body
			count = 0;
	    	while(count < 4096 && (chunks != 1 || count < lastChunkSize )){
                if(( huart1.Instance->SR & UART_FLAG_RXNE) == UART_FLAG_RXNE){ // ! (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_TXE) ) ){
                    c = (uint8_t)huart1.Instance->DR; // & (uint8_t)0xFF);

//HAL_FLASH_Program();
                    /* Program the user Flash area byte by byte
					(area defined by FLASH_USER_START_ADDR and FLASH_USER_END_ADDR) ***********/

                    /* Wait for last operation to be completed */
                    if(FLASH_WaitInRAMForLastOperationWithMaxDelay() == HAL_OK)
                    {
                        /*Program byte (8-bit) at a specified address.*/
                        // FLASH_Program_Byte(Address, (uint8_t) c);
                        CLEAR_BIT(FLASH->CR, FLASH_CR_PSIZE);
                        FLASH->CR |= FLASH_PSIZE_BYTE;
                        FLASH->CR |= FLASH_CR_PG;

                        *(__IO uint8_t*)Address = c;
                        // end FLASH_Program_Byte(Address, (uint8_t) c);

                      /* Wait for last operation to be completed */
                      FLASH_WaitInRAMForLastOperationWithMaxDelay();

                      /* If the program operation is completed, disable the PG Bit */
                      FLASH->CR &= (~FLASH_CR_PG);
					  Address++;
					  // end HAL_FLASH_Program
                    }else{
                    	return;
                    }
					count++;
                }
	    	}

	    	chunks--;
	    	http_request_header[HTTP_REQUEST_CHUNK_PARAM_POS]++;
	    	if(http_request_header[HTTP_REQUEST_CHUNK_PARAM_POS] == 58)
	    		http_request_header[HTTP_REQUEST_CHUNK_PARAM_POS] = 65;
	    	else if(http_request_header[HTTP_REQUEST_CHUNK_PARAM_POS] == 91)
	    		http_request_header[HTTP_REQUEST_CHUNK_PARAM_POS] = 97;

	    	count = 0;
	    	while(count++ < 20000000){

	    	} // won't work at __disable_irq(); !!

	    	count = 0;
	    }
        __HAL_UNLOCK(&pFlash);

        // End Transparent Transmission
    	count = 0;
		while(1){ // todo set and break on timeout ?
			if(( huart1.Instance->SR & UART_FLAG_TXE) == UART_FLAG_TXE){ // ! (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_TXE) ) ){
				huart1.Instance->DR = '+'; //ATCMD6[count++]; // & (uint8_t)0xFF);
				if(count++ == 2)
					break;
			}
		}

//		while(HAL_UART_Receive(&huart1, &c,1, 100 ) == HAL_OK){	}
		__enable_irq();
		NVIC_SystemReset();

}


/*************************************************************************
 * Menu Handling
 *************************************************************************/

MENU_ENTRY menu_entries[NUM_MENU_ITEMS ]__attribute__((section(".ccmram")));

char *get_filename_ext(char *filename) {
	char *dot = strrchr(filename, '.');
	if(!dot || dot == filename) return "";
	return dot + 1;
}

int is_valid_file(char *filename) {
	char *ext = get_filename_ext(filename);
	EXT_TO_CART_TYPE_MAP *p = ext_to_cart_type_map;
	while (p->ext) {
		if (strcasecmp(ext, p->ext) == 0)
			return 1;
		p++;
	}
	return 0;
}

void make_menu_entry( MENU_ENTRY **dst, char *name, int type){
	(*dst)->type = type;
	strcpy((*dst)->entryname, name);
	(*dst)->filesize = 0U;
	(*dst)++;
	num_menu_entries++;
}

void buildMenuFromPath( MENU_ENTRY *d )  {
	int count = 0;
	uint8_t c;
	_Bool loadStore = FALSE;
	_Bool is_entry_row;
	uint8_t pos = 0;
	num_menu_entries = 0;

	MENU_ENTRY *dst = (MENU_ENTRY *)&menu_entries[0];

	if(strncmp(MENU_TEXT_SETUP, curPath, sizeof(MENU_TEXT_SETUP) - 1) == 0 ){
		if(strlen(curPath) == sizeof(MENU_TEXT_SETUP) - 1 ){
			make_menu_entry(&dst, "(GO Back)", Leave_Menu);
			make_menu_entry(&dst, MENU_TEXT_WIFI_SETUP, Sub_Menu);
			make_menu_entry(&dst, MENU_TEXT_TV_MODE_SETUP, Sub_Menu);
			//make_menu_entry(&dst, MENU_TEXT_PRIVATE_KEY, Sub_Menu);
        	set_menu_status_msg("Ver. " VERSION "  ");
			loadStore = TRUE;
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_WIFI_SETUP, sizeof(MENU_TEXT_WIFI_SETUP) - 1) == 0 ){
			if(strlen(curPath) > sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) ){
				if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect to WiFi
					// curPath is: MENU_TEXT_SETUP + "/" + MENU_TEXT_WIFI_SETUP + "/" SSID[33] + Password + "/Enter" + '\0'
					curPath[strlen(curPath) - 6 ] = '\0'; // delete "/Enter" at end of Path

					// TODO before we send them to esp8266 escape , " and \ in SSID and Password..
					int i = sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP);
			        while( curPath[i] != 30 && i < ( sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 31) ){
			            i++;
			        }
			        curPath[i] = 0;

			    	if(esp8266_wifi_connect( &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP)  ], &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 32])){
			        	set_menu_status_msg(STATUS_MESSAGE_WIFI_CONNECTED);
			    	}else{
			        	set_menu_status_msg(STATUS_MESSAGE_WIFI_NOT_CONNECTED);
			    	}
					curPath[0] = '\0';
				}else{
					make_menu_entry(&dst, "(GO BACK)", Leave_Menu); // TODO Delete last char not all
					char Key[2] = "0";
					for (char i=32; i < 96; i++){
						Key[0] = i;
						make_menu_entry(&dst, Key, Keyboard_Char);
					}
					make_menu_entry(&dst, "Enter", Menu_Action);
				}

			}else{
				make_menu_entry(&dst, "(GO BACK)", Leave_Menu);
				if( esp8266_wifi_list( &dst, &num_menu_entries) == FALSE){
		        	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
		    		return;
		    	}
			}
		}else if( strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_TV_MODE_SETUP, sizeof(MENU_TEXT_TV_MODE_SETUP) - 1) == 0 ){
			if(d->type == Menu_Action){
				HAL_FLASH_Unlock();
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_TV_MODE_SETUP)], MENU_TEXT_TV_MODE_PAL) == 0){
					set_tv_mode(TV_MODE_PAL);
					if(tv_mode != TV_MODE_PAL){
						FLASH_Erase_Sector(FLASH_SECTOR_11, (uint8_t) FLASH_VOLTAGE_RANGE_3); // TODO use User-Option Bytes for TV Mode (0x1FFF C000) bits 0-1 are unused, but don't change RDP, BOR WDG and RST!
						HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, FLASH_CONFIG_ADDRESS, ((uint32_t)TV_MODE_PAL) );
					}
					tv_mode = TV_MODE_PAL;
				}else if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_TV_MODE_SETUP)], MENU_TEXT_TV_MODE_PAL60) == 0){
					set_tv_mode(TV_MODE_PAL60);
					if(tv_mode != TV_MODE_PAL60){
						FLASH_Erase_Sector(FLASH_SECTOR_11, (uint8_t) FLASH_VOLTAGE_RANGE_3);
						HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, FLASH_CONFIG_ADDRESS, ((uint32_t)TV_MODE_PAL60) );
					}
					tv_mode = TV_MODE_PAL60;
				}else{ // if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_TV_MODE_SETUP)], MENU_TEXT_TV_MODE_NTSC) == 0)
					set_tv_mode(TV_MODE_NTSC);
					if(tv_mode != TV_MODE_NTSC){
						FLASH_Erase_Sector(FLASH_SECTOR_11, (uint8_t) FLASH_VOLTAGE_RANGE_3);
						HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, FLASH_CONFIG_ADDRESS, ((uint32_t)TV_MODE_NTSC) );
					}
					tv_mode = TV_MODE_NTSC;
				}
				HAL_FLASH_Lock();
	        	curPath[0] = '\0';
			}else{
				make_menu_entry(&dst, "(GO Back)", Leave_Menu);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_PAL, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_PAL60, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_NTSC, Menu_Action);
			}

		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_USER_SETUP, sizeof(MENU_TEXT_USER_SETUP) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect user
				if( esp8266_PlusStore_API_prepare_request(curPath) == FALSE){
	            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
					return;
				}
	        	HAL_UART_Transmit(&huart1, (uint8_t *)http_request_header, strlen(http_request_header), 50);

