Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	        	skip_http_header();
	        	while(HAL_UART_Receive(&huart1, &c, 1, 50 ) == HAL_OK){}
	        	if(c == '0')
	        		set_menu_status_msg(STATUS_MESSAGE_USER_CONNECT_FAILED);
	        	else
	        		set_menu_status_msg(STATUS_MESSAGE_USER_CONNECTED);

	        	if( ! close_transparent_transmission() ){
	            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
	        		return;
	        	}

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_USER_SETUP) == 0){
					set_menu_status_msg(STATUS_MESSAGE_USER_CONNECT);
				}

				make_menu_entry(&dst, "(GO BACK)", Leave_Menu); // TODO Delete last Char or All?
				char Key[2] = "0";
				for (char i=32; i < 96; i++){
					Key[0] = i;
					make_menu_entry(&dst, Key, Keyboard_Char);
				}
				make_menu_entry(&dst, "Enter", Menu_Action);
			}
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PRIVATE_KEY, sizeof(MENU_TEXT_PRIVATE_KEY) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Save Private key
				set_menu_status_msg(STATUS_MESSAGE_PRIVATE_KEY_SAVED);

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PRIVATE_KEY ) == 0){
					set_menu_status_msg(STATUS_MESSAGE_PRIVATE_KEY);
				}

				make_menu_entry(&dst, "(GO BACK)", Leave_Menu); // TODO Delete last Char or All?
				char Key[2] = "0";
				for (char i=32; i < 96; i++){
					Key[0] = i;
					make_menu_entry(&dst, Key, Keyboard_Char);
				}
				make_menu_entry(&dst, "Enter", Menu_Action);
			}
		}
	}else if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action..
		if(strncmp(MENU_TEXT_FIRMWARE_UPDATE, curPath, sizeof(MENU_TEXT_FIRMWARE_UPDATE) - 1) == 0 ){

			if( esp8266_PlusStore_API_prepare_request("&u=1") == FALSE){
		    	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
			}
			__disable_irq();  // Disable interrupts
			HAL_FLASH_Unlock();
			// do Flashing in ram !!
			do_firmware_update(d->filesize, (uint8_t *)http_request_header);
		}
    	curPath[0] = '\0';
	}else{
		loadStore = TRUE;
	}

	// Test we should load store and if connected to AP
    if(	loadStore || strlen(curPath) == 0 ){
    	if(esp8266_is_connected() == TRUE){
			if( esp8266_PlusStore_API_prepare_request(curPath) == FALSE){
            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
				return;
			}

            HAL_UART_Transmit(&huart1, (uint8_t *)http_request_header, strlen(http_request_header), 50);
        	skip_http_header();
        	count = 0;
        	while(HAL_UART_Receive(&huart1, &c, 1, 50 ) == HAL_OK){
        		if(num_menu_entries < NUM_MENU_ITEMS){
                    if(count == 0){ // first char defines if its an entry row (or Header Row)
                    	is_entry_row = (c > '/' && c < ':' ) ? TRUE : FALSE; // First char is entry.type '0' to '9'
                        if(is_entry_row){
                        	dst->type = c - 48;
                        }
                    }else if( is_entry_row ){
                    	if(count == 1){
                            dst->filesize = 0U;
                            pos = 0;
                    	}else if( count < 8 ){ // get the filesize
                   			dst->filesize = dst->filesize * 10 + ( c -'0' );
                    	}else if( count > 8 && count < 41 && c != '\n'){ // filename/dirname should begin at index 9
                    		dst->entryname[pos] = c;
                    		pos++;
                    	}
                    }
                    if (c == '\n'){
                    	if(is_entry_row){
                            dst->entryname[pos] = '\0';
                            dst++;
                            num_menu_entries++;
                    	}
                        count = 0;
                    }else{
                        count++;
                    }
        		}
        	}

        	if(! close_transparent_transmission()){
            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
        		return;
        	}
        }else {
        	set_menu_status_msg(STATUS_MESSAGE_WIFI_NOT_CONNECTED);
    	}

    }

    if(strlen(curPath) == 0){
		make_menu_entry(&dst, MENU_TEXT_SETUP, Sub_Menu);
	}
}

CART_TYPE identify_cartridge( MENU_ENTRY *d )
{

	unsigned int image_size = 0;
	CART_TYPE cart_type = { base_type_None, FALSE, FALSE };

	strcat(curPath, "/");
    strcat(curPath, d->entryname);

	// Test if connected to AP
    if(esp8266_is_connected() == FALSE){
    	return cart_type;
    }

    // select type by file extension?
	char *ext = get_filename_ext(curPath);
	EXT_TO_CART_TYPE_MAP *p = ext_to_cart_type_map;
	while (p->ext) {
		if (strcasecmp(ext, p->ext) == 0) {
			cart_type = p->cart_type;
			break;
		}
		p++;
	}

	// Supercharger cartridges get special treatment, since we don't load the entire
	// file into the buffer here
	if (cart_type.base_type == base_type_None && (d->filesize % 8448) == 0)
		cart_type.base_type = base_type_AR;
	if (cart_type.base_type == base_type_AR){
		image_size = d->filesize;
		goto close;
	}

    image_size = esp8266_PlusStore_API_file_request( buffer, curPath, 0, d->filesize );

	cart_type.withPlusFunctions = isProbablyPLS(image_size, buffer);
	cart_type.withSuperChip =  isProbablySC(image_size, buffer);

	// disconnect here or if cart_type != CART_TYPE_NONE
	if (cart_type.base_type != base_type_None) goto close;

	// If we don't already know the type (from the file extension), then we
	// auto-detect the cart type - largely follows code in Stella's CartDetector.cpp

	if (image_size == 2*1024)
	{
		if (isProbablyCV(image_size, buffer))
			cart_type.base_type = base_type_CV;
		else
			cart_type.base_type = base_type_2K;
	}
	else if (image_size == 4*1024)
	{
		cart_type.base_type = base_type_4K;
	}
	else if (image_size == 8*1024)
	{
		// First check for *potential* F8
		int f8 = isPotentialF8(image_size, buffer);

		if (memcmp(buffer, buffer + 4096, 4096) == 0)
			cart_type.base_type = base_type_4K;
		else if (isProbablyE0(image_size, buffer))
			cart_type.base_type = base_type_E0;
		else if (isProbably3E(image_size, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(image_size, buffer))
			cart_type.base_type = base_type_3F;
		else if (isProbablyFE(image_size, buffer) && !f8)
			cart_type.base_type = base_type_FE;
		else if (isProbably0840(image_size, buffer))
			cart_type.base_type = base_type_0840;
		else
			cart_type.base_type = base_type_F8;
	}
	else if(image_size >= 10240 && image_size <= 10496)
	{  // ~10K - Pitfall II
		cart_type.base_type = base_type_DPC;
	}
	else if (image_size == 12*1024)
	{
		cart_type.base_type = base_type_FA;
	}
	else if (image_size == 16*1024)
	{
		if (isProbablyE7(image_size, buffer))
			cart_type.base_type = base_type_E7;
		else if (isProbably3E(image_size, buffer))
			cart_type.base_type = base_type_3E;
		else
			cart_type.base_type = base_type_F6;
	}
	else if (image_size == 32*1024)
	{
		if (isProbably3E(image_size, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(image_size, buffer))
			cart_type.base_type = base_type_3F;
		else
			cart_type.base_type = base_type_F4;
	}
	else if (image_size == 64*1024)
	{
		if (isProbably3E(image_size, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(image_size, buffer))
			cart_type.base_type = base_type_3F;
		else if (isProbablyEF(image_size, buffer))
			cart_type.base_type = base_type_EF;
		else
			cart_type.base_type = base_type_F0;
	}

	close:

